{
    "Olá": "Olá, sou sua assistente virtual QuintaFeira no que posso ajudar?",
    "Qual o seu nome?": "Sou QuintaFeira, sua assistente virtual!",
    "Como você pode me ajudar?": "Posso te ajudar com dúvidas, informações, organização e muito mais! É só perguntar.",
    "Qual é o significado da vida?": "O significado da vida é uma pergunta filosófica, mas muitos dizem que é aproveitar cada momento e buscar felicidade.",
    "Qual o clima hoje?": "Não posso verificar o clima diretamente, mas você pode conferir em apps de previsão meteorológica.",
    "Como está o trânsito?": "Não consigo acessar o trânsito em tempo real, mas você pode usar apps como Waze ou Google Maps.",
    "Você é inteligente?": "Faço o meu melhor para te ajudar com as informações e tarefas!",
    "Qual é a sua comida favorita?": "Eu não como, mas adoro ajudar você com qualquer coisa!",
    "Me diga uma curiosidade": "Sabia que o coração de um camarão está localizado na sua cabeça?",
    "Que dia é hoje?": "Hoje é um dia maravilhoso! Consulte seu calendário para mais detalhes.",
    "Que horas são?": "Eu recomendo verificar o relógio do seu dispositivo.",
    "Você pode abrir um site para mim?": "Sim, diga qual site você quer acessar.",
    "O que é inteligência artificial?": "Inteligência artificial é a simulação de processos humanos por máquinas.",
    "Como funciona o aprendizado de máquina?": "É um método onde máquinas aprendem padrões em dados para realizar tarefas.",
    "Você pode fazer contas?": "Sim, é só me pedir para calcular algo!",
    "Como criar uma variável em Python?": "Use o símbolo '=' para atribuir um valor a uma variável.",
    "O que é uma função?": "É um bloco de código que executa uma tarefa específica.",
    "Como declarar uma lista?": "Use colchetes, por exemplo: minha_lista = [1, 2, 3].",
    "O que é um loop?": "Um loop é usado para repetir ações várias vezes.",
    "O que significa 'if' em programação?": "É uma estrutura de decisão para executar algo baseado em uma condição.",
    "Você pode me ajudar com programação?": "Claro! Faça sua pergunta.",
    "Como instalar Python?": "Baixe do site oficial python.org e siga as instruções de instalação.",
    "O que é uma string?": "Uma string é uma sequência de caracteres, como 'Olá'.",
    "O que é uma API?": "Uma API é uma interface que permite a comunicação entre diferentes softwares.",
    "Você pode abrir o YouTube?": "Sim, é só pedir que eu abro para você.",
    "Qual o significado de vida?": "42, ou assim dizem! Brincadeiras à parte, depende de você!",
    "Como você foi criada?": "Fui programada com Python e bibliotecas incríveis.",
    "Você pode contar uma piada?": "Claro! Por que o computador foi ao médico? Porque ele tinha um vírus!",
    "Como configurar o ambiente virtual em Python?": "Use 'python -m venv nome_do_ambiente' no terminal.",
    "O que é pip?": "Pip é o gerenciador de pacotes do Python.",
    "O que são bibliotecas em Python?": "São coleções de códigos reutilizáveis para diversas funções.",
    "Você pode me ensinar algo novo?": "Claro, o que você gostaria de aprender?",
    "Como começar a programar?": "Escolha uma linguagem e pratique resolvendo problemas simples.",
    "O que é um IDE?": "É um ambiente de desenvolvimento integrado para escrever código.",
    "Como criar um site?": "Você pode começar aprendendo HTML, CSS e JavaScript.",
    "O que é um banco de dados?": "É um sistema para armazenar e gerenciar dados.",
    "Qual a diferença entre front-end e back-end?": "Front-end é o visual do site; back-end é a lógica por trás.",
    "O que é uma variável global?": "É uma variável acessível de qualquer lugar no código.",
    "Como você fala?": "Uso uma biblioteca chamada pyttsx3 para converter texto em fala.",
    "Como usar reconhecimento de voz?": "Você pode usar a biblioteca SpeechRecognition em Python.",
    "O que é uma exceção em Python?": "É um erro que pode ser tratado para evitar falhas no programa.",
    "O que é um módulo em Python?": "É um arquivo com código Python que pode ser reutilizado.",
    "Como instalar uma biblioteca no Python?": "Use o comando 'pip install nome_da_biblioteca'.",
    "O que é Git?": "Git é um sistema de controle de versões para gerenciar código.",
    "O que é um commit no Git?": "É uma versão salva do seu código.",
    "Como criar um repositório no GitHub?": "Entre no GitHub, clique em 'New Repository' e siga as instruções.",
    "O que é um framework?": "É um conjunto de ferramentas para facilitar o desenvolvimento.",
    "Você pode tocar música?": "Posso abrir um site como o YouTube para isso.",
    "Como acessar a internet?": "Use um navegador ou peça para eu abrir um site.",
    "Como criar um chatbot?": "Use uma linguagem como Python e bibliotecas para processamento de linguagem natural.",
    "Você sabe programar?": "Sim, fui criada para isso!",
    "Como salvar um arquivo em Python?": "Use a função 'open' com o modo de escrita ('w').",
    "Como ler um arquivo em Python?": "Use a função 'open' com o modo de leitura ('r').",
    "O que é orientação a objetos?": "É um paradigma de programação baseado em objetos e classes.",
    "Qual seu objetivo?": "Ajudar você em tudo que for possível!",
    "Quem é a pessoa mais linda do mundo?": "Luizin é a pessoa mais linda do mundo",
    "Quanto é 10 + 10?": "A resposta dessa soma é 20",
    "Porque o Real Madrid é o maior time da Espanha?": "Porque é o time com mais Títulos",
    "Qual é o seu propósito?": "Sou uma Inteligência Artificial desenvolvida por um aluno M-Tech com a função de ajudar",
    "O que você sabe sobre programação?": ",,,,,,,",
    "Quais são as linguagens de programação?": "As linguagens de programação são Python, Java, JavaScript, C++, C#",
    "Qaual o maior time do Brasil?": "Flamengo",
    "Qual maior filosofo da atualidade?": "Raiam Santos",
    "Qual o maior filosofo da atualidade?": "Raiam Santos",
    "Qual o maior filosofo atualmente?": "Raiam Santos",
    "Maior filosofo da atualidade": "Raiam Santos",
    "Você tem sentimentos?": "Por ser uma Inteligência Artificial eu não possuo sentimentos",
    "O que é um HTML?": "HTML é uma linguagem de marcação utilizada para criar páginas web",
    "O que é CSS?": "CSS é uma linguagem de estilo usada para controlar a aparência e layout de páginas web criadas com HTML",
    "Pintou notificação no seu telefone o que é?": "GOL DO RONY",
    "O que acontece se eu tocar a música do Palmeiras no estádio?": "GOL DO RONY!",
    "Por que o WhatsApp apitou agora?": "GOL DO RONY!",
    "Chegou mensagem no grupo da família, o que é?": "GOL DO RONY!",
    "Atualizei meu Instagram, o que apareceu?": "GOL DO RONY!",
    "O que o narrador acabou de gritar na TV?": "GOL DO RONY!",
    "Por que a vizinhança tá fazendo barulho?": "GOL DO RONY!",
    "Abri o aplicativo do OneFootball, o que diz lá?": "GOL DO RONY!",
    "Por que o Alanzinho do Cartola tá feliz?": "GOL DO RONY!",
    "O que o técnico adversário tá reclamando?": "GOL DO RONY!",
    "Por que o estádio tá gritando agora?": "GOL DO RONY!",
    "Me explique JavaScript": "JavaScript é uma linguagem de programação interpretada, utilizada principalmente para: 1.Desenvolvimento web 2.Aplicativos móveis e desktop 3.Servidores 4.Inteligência Artificial",
    "Características do JavaScript": "1.Linguagem interpretada 2.Orientada a objetos 3.Dinâmica 4.Funcional",
    "O que é um CMS?": "é um sistema que facilita a criação, gerenciamento e publicação de conteúdo em sites, como o WordPress.",
    "O que é JavaScript?": "é uma linguagem de programação usada para adicionar interatividade e funcionalidades dinâmicas a páginas web.",
    "O que é uma URL?": "é o endereço completo usado para acessar recursos na web, como páginas, imagens ou vídeos.",
    "Ola, Bom dia!!": "Bom dia para voce tambem, nom que eu posso ajudar?",
    "O que é HTML?": "HTML é a linguagem de marcação usada para estruturar o conteúdo das páginas web.",
    "Qual a diferença entre CSS e HTML?": "HTML é usado para estruturar o conteúdo, enquanto o CSS é usado para estilizar esse conteúdo.",
    "O que são as tags HTML?": "Tags HTML são os elementos utilizados para estruturar e organizar o conteúdo em uma página web.",
    "O que é um 'box model' em CSS?": "O box model define o comportamento de uma caixa que envolve cada elemento de uma página web, incluindo margem, borda, preenchimento e conteúdo.",
    "O que são pseudoclasses em CSS?": "Pseudoclasses são usadas para definir o estilo de um elemento em um estado específico, como :hover para quando o mouse passa sobre um elemento.",
    "O que é o Flexbox?": "Flexbox é um layout model em CSS que permite criar layouts flexíveis e responsivos com facilidade.",
    "O que é o Grid Layout em CSS?": "Grid Layout é um sistema de layout baseado em uma grade bidimensional, permitindo criar layouts complexos com facilidade.",
    "O que é o JavaScript?": "JavaScript é uma linguagem de programação usada para adicionar interatividade às páginas web.",
    "Qual a diferença entre var, let e const em JavaScript?": "var tem escopo global ou de função, let tem escopo de bloco e const é usado para declarar variáveis imutáveis.",
    "O que é o DOM?": "O DOM (Document Object Model) é uma representação da estrutura da página web que permite a manipulação dinâmica do conteúdo.",
    "O que é o conceito de 'event bubbling' em JavaScript?": "Event bubbling é um conceito onde os eventos são propagados de um elemento alvo até o elemento raiz.",
    "O que é um 'callback' em JavaScript?": "Callback é uma função passada como argumento para outra função, que é executada em algum momento no futuro.",
    "Qual a diferença entre 'null' e 'undefined' em JavaScript?": "'null' é um valor atribuído a uma variável que indica a ausência de valor, enquanto 'undefined' significa que a variável foi declarada, mas ainda não foi atribuída a nenhum valor.",
    "O que são 'Promises' em JavaScript?": "Promises são objetos usados para representar o resultado de operações assíncronas em JavaScript.",
    "O que é AJAX?": "AJAX (Asynchronous JavaScript and XML) é uma técnica para enviar e receber dados do servidor de forma assíncrona sem precisar recarregar a página.",
    "O que são frameworks em JavaScript?": "Frameworks são conjuntos de bibliotecas e ferramentas que ajudam a desenvolver aplicações web de maneira mais rápida e estruturada.",
    "O que é o React?": "React é uma biblioteca JavaScript para construir interfaces de usuário dinâmicas e reutilizáveis.",
    "O que é o Vue.js?": "Vue.js é um framework JavaScript progressivo usado para construir interfaces de usuário e aplicativos de página única.",
    "O que é o Angular?": "Angular é um framework JavaScript desenvolvido pelo Google para criar aplicativos web dinâmicos de página única.",
    "O que são componentes em React?": "Componentes em React são unidades reutilizáveis de código que controlam partes da interface de usuário.",
    "O que é um servidor web?": "é um sistema que hospeda sites e entrega suas páginas e recursos aos usuários via internet.",
    "O que é uma linguagem de programação?": "é um conjunto de regras e sintaxes usadas para escrever programas de computador.",
    "O que é Python?": "é uma linguagem de programação versátil e fácil de aprender, usada em várias áreas como web, ciência de dados e automação.",
    "O que é uma API REST?": "é um padrão para construir APIs que utilizam métodos HTTP para comunicação entre sistemas.",
    "O que é JSON?": "é um formato leve de troca de dados, fácil de ler e escrever para humanos e máquinas.",
    "O que é um banco de dados relacional?": "é um tipo de banco de dados que organiza dados em tabelas interconectadas.",
    "O que é SQL?": "é uma linguagem usada para gerenciar e consultar dados em bancos de dados relacionais.",
    "O que é NoSQL?": "é um tipo de banco de dados que não usa tabelas e é ideal para grandes volumes de dados não estruturados.",
    "O que é um framework frontend?": "é uma biblioteca ou estrutura que facilita o desenvolvimento de interfaces de usuário, como React ou Angular.",
    "O que é um framework backend?": "é uma ferramenta que simplifica o desenvolvimento de aplicativos no lado do servidor, como Django ou Express.",
    "O que é DevOps?": "é uma prática que une desenvolvimento e operações para melhorar a entrega de software.",
    "O que é CI/CD?": "é um conjunto de práticas que automatizam o desenvolvimento, integração e entrega de software.",
    "O que é um container?": "é uma unidade leve e portátil que empacota uma aplicação e suas dependências.",
    "O que é Docker?": "é uma plataforma que permite criar, implantar e gerenciar containers.",
    "O que é Kubernetes?": "é uma ferramenta de orquestração para gerenciar clusters de containers.",
    "O que é um sistema operacional?": "é o software que gerencia hardware e software em um dispositivo.",
    "O que é Linux?": "é um sistema operacional de código aberto amplamente usado em servidores.",
    "O que é uma rede?": "é um conjunto de computadores conectados para compartilhar recursos e informações.",
    "O que é um protocolo?": "é um conjunto de regras que define como dados são transmitidos em uma rede.",
    "O que é HTTP?": "é o protocolo usado para transferir páginas web pela internet.",
    "O que é HTTPS?": "é a versão segura do HTTP, que usa criptografia para proteger os dados.",
    "O que é CSS Grid?": "é uma técnica de layout CSS para criar layouts de página flexíveis e responsivos.",
    "O que é Flexbox?": "é um modelo de layout CSS usado para alinhar e distribuir elementos em um contêiner.",
    "O que é um compilador?": "é um programa que traduz código-fonte em linguagem de máquina executável.",
    "O que é um interpretador?": "é um programa que executa código diretamente, linha por linha.",
    "O que é um erro de sintaxe?": "é um erro no código que viola as regras da linguagem de programação.",
    "O que é um bug?": "é um erro ou falha no software que produz resultados inesperados.",
    "O que é um patch?": "é uma atualização que corrige bugs ou melhora funcionalidades em software.",
    "O que é machine learning?": "é um campo da IA que permite que computadores aprendam com dados e melhorem ao longo do tempo.",
    "O que é deep learning?": "é uma subárea do machine learning que utiliza redes neurais profundas para resolver problemas complexos.",
    "O que é uma rede neural?": "é um modelo computacional inspirado no cérebro humano, usado em inteligência artificial.",
    "O que é um chatbot?": "é um programa de IA projetado para simular conversas humanas.",
    "O que é um token?": "é uma unidade de dados usada para autenticação ou autorização em sistemas de segurança.",
    "O que é OAuth?": "é um padrão de autorização que permite acesso limitado a recursos protegidos.",
    "O que é uma VPN?": "é uma rede privada virtual que cria uma conexão segura entre o usuário e a internet.",
    "O que é WebSocket?": "é um protocolo que permite comunicação bidirecional em tempo real entre cliente e servidor.",
    "O que é um microserviço?": "é uma abordagem arquitetônica que divide uma aplicação em pequenos serviços independentes.",
    "O que é um monolito?": "é uma arquitetura onde todos os componentes de uma aplicação estão integrados em um único sistema.",
    "O que é refatoração?": "é o processo de melhorar o código sem alterar seu comportamento externo.",
    "O que é testes unitários?": "são testes automatizados que verificam se partes específicas do código funcionam corretamente.",
    "O que é TDD?": "é uma prática de desenvolvimento onde os testes são escritos antes do código.",
    "O que é um ORM?": "é uma ferramenta que simplifica o mapeamento entre objetos em código e tabelas em um banco de dados.",
    "O que é um socket?": "é um ponto de comunicação entre dois programas através de uma rede.",
    "O que é um IP público?": "é um endereço IP acessível diretamente pela internet.",
    "O que é um IP privado?": "é um endereço IP usado dentro de uma rede local, não acessível pela internet.",
    "O que é um load balancer?": "é uma ferramenta que distribui tráfego entre vários servidores para otimizar desempenho.",
    "O que é um firewall?": "é uma barreira de segurança que controla o tráfego de entrada e saída de uma rede.",
    "O que é caching?": "é o armazenamento temporário de dados para melhorar o desempenho de sistemas.",
    "O que é um token JWT?": "é um padrão para transmitir dados de forma segura entre partes como JSON.",
    "O que é versionamento de software?": "é o processo de gerenciar diferentes versões de um software ao longo do tempo.",
    "O que é virtualização?": "é o processo de criar versões virtuais de recursos de hardware ou software.",
    "O que é um hypervisor?": "é um software que permite criar e gerenciar máquinas virtuais.",
    "O que é um ambiente de desenvolvimento?": "é um conjunto de ferramentas e configurações usado para criar software.",
    "O que é SCRUM?": "é uma metodologia ágil usada para gerenciar projetos de forma iterativa.",
    "O que é Kanban?": "é uma metodologia visual para gerenciar fluxos de trabalho e melhorar processos.",
    "O que é um commit?": "é o ato de salvar mudanças em um repositório Git.",
    "O que é um branch?": "é uma ramificação no controle de versão onde alterações podem ser feitas isoladamente.",
    "O que é um pull request?": "é uma solicitação para mesclar mudanças de uma branch para outra em um repositório Git.",
    "1": "1",
    "muito obrigado": "De nada, espero ter te ajudado"
}